// ==========================================
// Уровень 1.5
// ==========================================
let sum = 0;
const userNumber1 = Number(prompt('Введите первое целое число:'));
const userNumber2 = Number(prompt('Введите второе целое число:'));
const userStr = prompt('Введите любой текст:');
// let resultStr = '';

// ------------------------------------------
// №1: Найдите сумму всех целых чисел от 1 до 10.

for (let i = 0; i <= 10; i ++) {
    sum += i;
}
    console.log('Сумма чисел от 1 до 10 = ', sum);

// ------------------------------------------
// №2: Найдите сумму всех целых четных чисел в промежутке от 1 до 10.
    sum = 0;
for (let i = 0; i <= 10; i ++) {
    
    if (i%2 === 0)
    sum += i;
}
    console.log('Сумма четных чисел от 1 до 10 = ', sum);

// ------------------------------------------
// №3: Найдите сумму всех целых нечетных чисел в промежутке от 1 до 10.

sum = 0;

for (let i = 0; i <= 10; i ++) {
    
    if (i%2 === 1)
    sum += i;
}
    console.log('Сумма нечетных чисел от 1 до 10 = ', sum)

// ------------------------------------------
// №4: Даны два целых числа. Найдите остаток от деления первого числа на второе.

let resultNum = userNumber1 % userNumber2; 
console.log('Остаток от деления = ', resultNum); 

// ------------------------------------------
// №5: Дана некоторая строка. Переберите и выведите в консоль по очереди все символы с конца строки.
/*
for (let i = userStr.length - 1; i >= 0; i--) {
        resultStr += userStr[i];
    }

    console.log('Все символы с конца: ', resultStr);
    */
    for (let i = userStr.length - 1; i >= 0; i--) {
    console.log('Символ: ', userStr[i]);
}