// ==========================================
// Уровень 1.7
// ==========================================

let userStr = prompt('Введите число или напишите текст:');

let arr = [];
let arrNum = [];

for (let i = 0; i < userStr.length; i++) {
    let char = userStr[i];
    // ------------------------------------------
    // №1: Дана строка:
    // 'abcde'
    // Получите массив букв этой строки.
    if ((char >= 'a' && char <= 'z') || (char >= 'A' && char <= 'Z') ||
        (char >= 'а' && char <= 'я') || (char >= 'А' && char <= 'Я') ||
        char === 'ё' || char === 'Ё') {
        arr[arr.length] = userStr[i];
    }
    // ------------------------------------------
    // №2: Дано некоторое число:
    // 12345
    // Получите массив цифр этого числа.
    if (char >= '0' && char <= '9'){
        arrNum[arrNum.length] = userStr[i];
    }
}
console.log('Массив букв = ', arr);
  
console.log('Массив цифр = ', arrNum);

// ------------------------------------------
// №3: Дано некоторое число:
// 12345
// Переверните его:
// 54321
let num = "";
let sum = 0;
for (let i = arrNum.length - 1; i >= 0; i--) {
    num += arrNum[i];
    sum = sum + (+arrNum[i]);
}
console.log('Перевернутое число = ', num);

// ------------------------------------------
// №4: Дано некоторое число:
// 12345
// Найдите сумму цифр этого числа.

console.log('Сумма цифр = ', sum);